schedule_monday4093 = """
     Понедельник
Группа 4093

⏰ 12:00 - 14:45
Практика
📝 Математика
Матвеева Ольга Павловна
4314

⏰ 15:00 - 15:45
Лекция
📝 Информационные технологии
Архипова Гелиря Асхатовна
4207

⏰ 16:00 - 16:45
Лекция
📝 Информационные технологии
Архипова Гелиря Асхатовна
4207
с 31 марта
     """

schedule_tuesday4093 = """
     Вторник
Группа 4093

⏰ 12:00 - 13:45
Лекция
📝 Математика
Матвеева Ольга Павловна
4поточная

⏰ 14:00 - 15:45
Лабораторная
📝 Основы программирования: Алгоритмические языки и программирование.
Кулаков Игорь Юрьевич
3315

⏰ 16:00 - 17:45
Практика
📝 Информационные технологии
Архипова Гелиря Асхатовна
4207
с 11.03 по 22.04

⏰ 16:00 - 17:45
📝 Практика учебная: Практика ознакомительная.
Архипова Гелиря Асхатовна
4207
с 29.04
     """

schedule_Wednesday4093 = """
    Среда
Группа 4093

⏰ 9:00 - 11:45
Практика
📝 Основы программирования: Алгоритмические языки и программирование.
Кулаков Игорь Юрьевич
3315

⏰ 12:00 - 13:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Пралич Богдан Сергеевич
Спортзал

⏰ 16:00 - 17:45
Практика
📝 2) Иностранный язык
Яковлева Ирина Вячеславовна
1321
ИГУМ, англ.яз, по нижней неделе
     """
schedule_thursday4093 = """
    Четверг
Группа 4093

⏰ 10:00 - 11:45
Лабораторная
📝 1) Архитектура ЭВМ и периферийных устройств
Савинова Марина Александровна
109
ПК

⏰ 10:00 - 11:45
Лабораторная
📝 2) Архитектура ЭВМ и периферийных устройств
Эрштейн Леонид Борисович
3317
Кафедра информационных технологий и систем

⏰ 14:00 - 15:45
Практика
📝 1) Иностранный язык
Костина Нина Николаевна
1331
ИГУМ, англ.яз, по нижней неделе

⏰ 15:00 - 16:45
Лекция
📝 Основы программирования: Алгоритмические языки и программирование.
Винник Людмила Ивановна
4поточная
по верхней неделе

⏰ 15:00 - 16:45
Лекция
📝 Основы программирования: Алгоритмические языки и программирование.
Винник Людмила Ивановна
4поточная
Кафедра информационных технологий и систем

⏰ 19:00 - 19:45
Практика
📝 1) Иностранный язык
Костина Нина Николаевна
с использованием ДОТ
     """

schedule_friday4093 = """
    Пятница
Группа 4093

⏰ 10:00 - 11:45
Лекция
📝 История России
Федорук Наталья Сергеевна
1поточная
по нижней неделе

⏰ 10:00 - 11:45
Лекция
📝 Экономика
Киварина Мария Валентиновна
1поточная
по верхней неделе

⏰ 14:00 - 16:45
Лекция
📝 Архитектура ЭВМ и периферийных устройств
Шаклеин В. Г.
Кафедра информационных технологий и систем

⏰ 19:00 - 19:45
Лекция
📝 История России
Федорук Наталья Сергеевна
с использованием ДОТ
"""

schedule_saturday4093 = """
    Суббота
Группа 4093

⏰ 10:00 - 11:45
📝 Экономика
Киварина Мария Валентиновна
с использованием ДОТ

⏰ 13:00 - 14:45
Практика
📝 3) Иностранный язык
Барышева Ангелина Алексеевна
1218
ИГУМ, нем.яз, по верхней неделе

⏰ 14:00 - 15:45
Практика
📝 Экономика
Киварина Мария Валентиновна
3311
по нижней неделе

⏰ 16:00 - 17:45
Практика
📝 История России
Борисевич Даниил Андреевич
4поточная
по нижней неделе

⏰ 19:00 - 19:45
Практика
📝 История России
Борисевич Даниил Андреевич
с использованием ДОТ

⏰ 20:00 - 20:45
Практика
📝 3) Иностранный язык
Барышева Ангелина Алексеевна
с использованием ДОТ
     """
schedule_monday4094 = """
"""
schedule_tuesday4094 = """
"""
schedule_Wednesday4094 = """
"""

schedule_thursday4094 = """
"""

schedule_friday4094 = """
"""

schedule_saturday4094 = """
"""

schedule_monday4092 = """
Понедельник
Группа 4092

⏰ 10:00 - 11:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Егорова Елена Алексеевна
Спортзал

⏰ 12:00 - 14:45
Практика
📝 Основы программирования: Алгоритмические языки и программирование.
Кулаков Игорь Юрьевич
3315
"""

schedule_tuesday4092 = """
Вторник
Группа 4092

⏰ 12:00 - 13:45
Лекция
📝 Математика
Матвеева Ольга Павловна
4поточная

⏰ 14:00 - 15:45
Практика
📝 Информационные технологии
Архипова Гелиря Асхатовна
4207
с 11.03 по 22.04

⏰ 14:00 - 15:45
📝 Практика учебная: Практика ознакомительная.
Архипова Гелиря Асхатовна
4207
с 29.04

⏰ 16:00 - 17:45
Лабораторная
📝 Основы программирования: Алгоритмические языки и программирование.
Кулаков Игорь Юрьевич
3315
"""

schedule_Wednesday4092 = """
Среда
Группа 4092

⏰ 9:00 - 10:45
Практика
📝 Математика
Кондюков Алексей Олегович
4поточная
12.03 СРС

⏰ 11:00 - 12:45
Лекция
📝 Информационные технологии
Архипова Гелиря Асхатовна
4207

⏰ 13:00 - 13:45
Практика
📝 Математика
Кондюков Алексей Олегович
4поточная
12.03 СРС

⏰ 15:00 - 16:45
Лабораторная
📝 1) Архитектура ЭВМ и периферийных устройств
Савинова Марина Александровна
109
ПК

⏰ 15:00 - 16:45
Лабораторная
📝 2) Архитектура ЭВМ и периферийных устройств
Эрштейн Леонид Борисович
3317
Кафедра информационных технологий и систем
"""

schedule_thursday4092 = """
Четверг
Группа 4092

⏰ 11:00 - 12:45
Практика
📝 1) Иностранный язык
Костина Нина Николаевна
1331
ИГУМ, англ.яз, по верхней неделе

⏰ 13:00 - 14:45
Практика
📝 2) Иностранный язык
Лебедева Елена Анатольевна
1313
ИГУМ, англ.яз, по нижней неделе

⏰ 15:00 - 16:45
Лекция
📝 Основы программирования: Алгоритмические языки и программирование.
Винник Людмила Ивановна
4поточная
по верхней неделе

⏰ 15:00 - 16:45
Лекция
📝 Основы программирования: Алгоритмические языки и программирование.
Винник Людмила Ивановна
4поточная
Кафедра информационных технологий и систем

⏰ 19:00 - 19:45
Практика
📝 2) Иностранный язык
Лебедева Елена Анатольевна
с использованием ДОТ

⏰ 19:00 - 19:45
Практика
📝 1) Иностранный язык
Костина Нина Николаевна
с использованием ДОТ
"""

schedule_friday4092 = """
Пятница
Группа 4092

⏰ 10:00 - 11:45
Лекция
📝 История России
Федорук Наталья Сергеевна
1поточная
по нижней неделе

⏰ 10:00 - 11:45
Лекция
📝 Экономика
Киварина Мария Валентиновна
1поточная
по верхней неделе

⏰ 14:00 - 16:45
Лекция
📝 Архитектура ЭВМ и периферийных устройств
Шаклеин В. Г.
Кафедра информационных технологий и систем

⏰ 19:00 - 19:45
Лекция
📝 История России
Федорук Наталья Сергеевна
с использованием ДОТ
"""

schedule_saturday4092 = """
Суббота
Группа 4092

⏰ 12:00 - 13:45
Практика
📝 Экономика
Киварина Мария Валентиновна
3311
по нижней неделе

⏰ 13:00 - 14:45
Практика
📝 3) Иностранный язык
Барышева Ангелина Алексеевна
1218
ИГУМ, нем.яз, по верхней неделе

⏰ 14:00 - 15:45
Практика
📝 История России
Борисевич Даниил Андреевич
4поточная
по нижней неделе

⏰ 17:00 - 18:45
📝 Экономика
Киварина Мария Валентиновна
с использованием ДОТ

⏰ 19:00 - 19:45
Практика
📝 История России
Борисевич Даниил Андреевич
с использованием ДОТ

⏰ 20:00 - 20:45
Практика
📝 3) Иностранный язык
Барышева Ангелина Алексеевна
с использованием ДОТ
"""

schedule_monday4711 = """
Понедельник
Группа 4711

⏰ 13:00 - 14:45
Лекция
📝 Физика
Росанов Андрей Александрович
1поточная

⏰ 15:00 - 16:45
Лекция
📝 Математика
Широколобова Ольга Борисовна
1поточная

⏰ 17:00 - 19:45
Практика
📝 Русский язык и культура речи
Корнева Юлия Геннадьевна
6401
для иностранных студентов
"""

schedule_tuesday4711 = """
Вторник
Группа 4711

⏰ 9:00 - 10:45
Практика
📝 1) Иностранный язык
Лопачев Артём Олегович
1331
англ.язык  ИГУМ Антоново по верхней неделе

⏰ 9:00 - 10:45
Практика
📝 2) Иностранный язык
Лопачев Артём Олегович
1331
англ.язык  ИГУМ Антоново по нижней неделе

⏰ 12:00 - 13:45
Практика
📝 Физика
Росанов Андрей Александрович
2904

⏰ 14:00 - 15:45
Практика
📝 Инженерная и компьютерная графика
Козлова Ирина Витальевна
5414

⏰ 16:00 - 16:45
Практика
📝 Инженерная и компьютерная графика
Козлова Ирина Витальевна
5414
по верхней неделе
"""

schedule_Wednesday4711 = """
Среда
Группа 4711

⏰ 8:00 - 9:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Киселева Светлана Викторовна
Спортзал
26.02 ;26.03; 30.04 и 28.05 занятий не будет

⏰ 11:00 - 12:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по верхней неделе

⏰ 11:00 - 12:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по  нижней неделе

⏰ 13:00 - 15:45
Практика
📝 Математика
Петрова Юлия Юрьевна
3207
"""

schedule_thursday4711 = """
Четверг
Группа 4711

⏰ 9:00 - 9:45
📝 Проектные дни
27.02; 27.03; 01.05 и 29.05  занятий не будет

⏰ 10:00 - 12:45
Практика
📝 Инженерная и компьютерная графика
Гуляев Вадим Игоревич
5413
по верхней неделе    01.05 и 29.05  занятий не будет

⏰ 11:00 - 12:45
📝 Практика учебная : Практика ознакомительная.
Нозирзода Шодмон Салохидин
4405
только 05.06

⏰ 14:00 - 14:45
Практика
📝 Основы проектной деятельности    Встреча с наставником.
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4711 = """
Пятница
Группа 4711

⏰ 9:00 - 9:45
📝 Проектные дни
28.02; 28.03; 02.05 и  30. 05  занятий не будет

⏰ 10:00 - 11:45
Лабораторная
📝 1) Физика
Росанов Андрей Александрович
2900
по верхней неделе  02.05 и 30.05  занятий не будет

⏰ 10:00 - 11:45
Лабораторная
📝 2) Физика
Росанов Андрей Александрович
2900
по  нижней неделе     28.02 и 28.03  занятий не будет

⏰ 10:00 - 11:45
Лабораторная
📝 3) Физика
Буренков Денис Сергеевич
2909
по  верхней неделе   02.05  и 30.05 занятий не будет

⏰ 12:00 - 13:45
Практика
📝 Русский язык и культура речи
Федорук Александра Вадимовна
4402
28.02; 28.03; 02.05 и  30. 05  занятий не будет

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе   02.05   и 30.05   занятий не будет , до 9 недели

⏰ 14:00 - 15:45
Практика
📝 Экономика
Веткина Анна Владимировна
1поточная
по нижней неделе   28.02 и 28.03  занятий не будет , до 9 недели

⏰ 17:00 - 18:45
📝 История России
Штрейс Денис Станиславович
с использованием ДОТ
"""

schedule_saturday4711 = """
Суббота
Группа 4711

⏰ 15:00 - 16:45
📝 Экономика
Веткина Анна Владимировна
с использованием ДОТ, до 9 недели

⏰ 17:00 - 18:45
Практика
📝 Иностранный язык
Лопачев Артём Олегович
по верхней неделе англ.язык   с использованием ДОТ
"""



schedule_monday4541 = """Понедельник
Группа 4541

⏰ 10:00 - 11:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Павлова Елена Игоревна
Спортзал
ул. Большая Санкт Петербургская 41;24.02, 24.03, 28.04, 26.05 занятий не будет

⏰ 12:00 - 12:45
Практика
📝 История России
Егорова Анастасия Васильевна
2705
ул. Большая Санкт Петербургская 41

⏰ 13:00 - 13:45
Лекция
📝 Экология
Терещенко Оксана Викторовна
5210
ул. Большая Санкт Петербургская 41; по верхней неделе; до 9 нед.

⏰ 13:00 - 13:45
Практика
📝 Экология
Терещенко Оксана Викторовна
5210
ул. Большая Санкт Петербургская 41; по нижней неделе; до 9 нед.

⏰ 14:00 - 15:45
Лекция
📝 Экология
Терещенко Оксана Викторовна
1307
ул. Большая Санкт Петербургская 41; по верхней неделе; до 9 нед.

⏰ 14:00 - 15:45
Практика
📝 Экология
Терещенко Оксана Викторовна
1307
ул. Большая Санкт Петербургская 41; по нижней неделе; до 9 нед.

⏰ 17:00 - 18:45
📝 Философия
Матвеев Вячеслав Викторович
с использование ДОТ с 17.02
"""

schedule_tuesday4541 = """
Вторник
Группа 4541

⏰ 9:00 - 10:45
Лекция
📝 Геодезия
Путинцева Наталья Юрьевна
5210
ул. Большая Санкт Петербургская 41

⏰ 12:00 - 13:45
📝 Геодезия
Сергеева Ирина Юрьевна
1.20
04.02; далее с 25.02; ИНТЦ; ул. Великая, 18А

⏰ 14:00 - 15:45
📝 Практика учебная : Практика ознакомительная.
Лукашик Евгений Евгеньевич
1.28
ИНТЦ; ул. Великая, 18А
"""

schedule_Wednesday4541 = """
Среда
Группа 4541

⏰ 9:00 - 10:45
Практика
📝 Иностранный язык
Медведева Наталья Геннадьевна
5210
англ.яз.; ул. Большая Санкт Петербургская 41, англ.яз по верхней неделе

⏰ 11:00 - 12:45
Лекция
📝 Математика
Ракова Марина Владимировна
3207
ул. Большая Санкт Петербургская 41; по 07.05 включительно

⏰ 17:00 - 18:45
Практика
📝 Иностранный язык
Медведева Наталья Геннадьевна
англ.яз по нижней неделе с использованием ДОТ
"""

schedule_thursday4541 = """
Четверг
Группа 4541

📝 Проектный день.
27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 9:00 - 9:45
Лекция
📝 Физика
Шубин Валерий Валентинович
2904
ул. Б.Санкт-Петербургская, 41; 27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 10:00 - 11:45
📝 Физика
Шубин Валерий Валентинович
2900
ул. Б.Санкт-Петербургская, 41; 27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 12:00 - 12:45
Лекция
📝 История России
Федорук Наталья Сергеевна
4поточная
ул. Большая Санкт Петербургская 41; 27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 14:00 - 14:45
📝 Основы проектной деятельности
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4541 = """
Пятница
Группа 4541

📝 Проектный день.
28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 9:00 - 11:45
Практика
📝 Математика
Ракова Марина Владимировна
4223
ул. Большая Санкт Петербургская 41; 28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 12:00 - 13:45
Практика
📝 Философия
Матвеев Вячеслав Викторович
5210
с 10 нед.; ул. Большая Санкт Петербургская 41; по верхней неделе

⏰ 12:00 - 13:45
Лекция
📝 Философия
Матвеев Вячеслав Викторович
4поточная
до 9 нед.; ул. Большая Санкт Петербургская 41; по нижней неделе;  по 25.04; 28.02 и 28.03 занятий не будет

⏰ 16:00 - 16:45
Лекция
📝 История России
Федорук Наталья Сергеевна
с использованием ДОТ

⏰ 17:00 - 17:45
Практика
📝 История России
Егорова Анастасия Васильевна
с использованием ДОТ
"""
schedule_saturday4541 = """
Суббота
Группа 4541

⏰ 10:00 - 11:45
Практика
📝 Иностранный язык
Барышева Ангелина Алексеевна
1318
нем.яз., по верхней неделе; ИГУМ(Антоново)

⏰ 10:00 - 11:45
Практика
📝 Иностранный язык
Барышева Ангелина Алексеевна
нем.яз., по нижней неделе; с использованием ДОТ

⏰ 13:00 - 14:45
Практика
📝 Философия
Матвеев Вячеслав Викторович
с 10 нед.; с использованием ДОТ

⏰ 13:00 - 14:45
Лекция
📝 Философия
Матвеев Вячеслав Викторович
до 9 нед.; с использованием ДОТ
"""


schedule_monday4413 = """
Понедельник
Группа 4413

⏰ 11:00 - 12:45
Лабораторная
📝 1) Физика
Буренков Денис Сергеевич
2900
по верхней неделе

⏰ 11:00 - 12:45
Лабораторная
📝 2) Физика
Буренков Денис Сергеевич
2900
по нижней неделе

⏰ 13:00 - 14:45
Лекция
📝 Физика
Росанов Андрей Александрович
1поточная

⏰ 15:00 - 16:45
Лекция
📝 Математика
Широколобова Ольга Борисовна
1поточная
"""

schedule_tuesday4413 = """
Вторник
Группа 4413

⏰ 8:00 - 9:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Пахомов Алексей Геннадьевич
.Спортзал
29.04, 27.05 занятий не будет

⏰ 10:00 - 11:45
📝 Практика учебная : Практика ознакомительная
Трофимов Павел Александрович
4423
только 03.06
"""

schedule_Wednesday4413 = """
Среда
Группа 4413

⏰ 9:00 - 10:45
Практика
📝 История России
Егорова Анастасия Васильевна
4412
по нижней неделе

⏰ 11:00 - 12:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по верхней неделе

⏰ 11:00 - 12:45
Лекция
📝 Теоретическая механика.
Кузнецов Николай Петрович
4405
по нижней неделе

⏰ 14:00 - 15:45
Практика
📝 Физика
Буренков Денис Сергеевич
2904

⏰ 16:00 - 18:45
Практика
📝 Математика
Широколобова Ольга Борисовна
3207
"""
schedule_thursday4413 = """
Четверг
Группа 4413

📝 Проектные дни
27.02; 27.03;01.05 и 29.05 занятий не будет

⏰ 9:00 - 10:45
Практика
📝 Иностранный язык
Барышева Ангелина Алексеевна
1318
нем.язык .ИГУМ Антоново по верхней неделе. 01.05 и  29.05  занятий не будет

⏰ 9:00 - 10:45
Практика
📝 Иностранный язык
Барышева Ангелина Алексеевна
нем.язык по нижней неделе с использованием ДОТ

⏰ 14:00 - 14:45
Практика
📝 Основы проектной деятельности   Встреча с наставником .
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4413 = """
Пятница
Группа 4413

📝 Проектные дни
28.02; 28.03  02.05 и 30.05  занятий не будет

⏰ 9:00 - 10:45
Практика
📝 Русский язык и культура речи
Макаров Владлен Иванович
28.02; 28.03  02.05 и 30.05  занятий не будет

⏰ 12:00 - 13:45
Практика
📝 Теоретическая механика
Кузнецов Николай Петрович
4405
по нижней неделе. 28.02 и 28.03 занятий не будет

⏰ 14:00 - 15:45
Лекция
📝 .Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе. 02.05 и 30.05 занятий не будет, до 9 недели

⏰ 15:00 - 16:45
Практика
📝 Иностранный язык
Лебедева Елена Анатольевна
1331
англ.язык. ИГУМ Антоново по нижней неделе. 28.02 и 28.03 занятий не будет

⏰ 16:00 - 17:45
Практика
📝 .Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе. 02.05 и 30.05 занятий не будет., до 9 недели

⏰ 9:00 - 10:45
Практика
📝 Русский язык и культура речи
Макаров Владлен Иванович
https://us05web.zoom.us/j/8409634063?pwd=QUR0cVU1WTF4Q3pPSzhpQ1R0L2Vvdz09
"""

schedule_saturday4413 = """
Суббота
Группа 4413

⏰ 15:00 - 16:45
📝 .Экономика
Веткина Анна Владимировна
с использованием ДОТ, до 9 недели

⏰ 17:00 - 17:45
Лекция
📝 История России
Штрейс Денис Станиславович
с использованием ДОТ

⏰ 18:00 - 18:45
Практика
📝 История России
Егорова Анастасия Васильевна
с использованием ДОТ
"""


schedule_monday4411 = """
Понедельник
Группа 4411

⏰ 11:00 - 12:45
Лабораторная
📝 1) Физика
Буренков Денис Сергеевич
2900
по верхней неделе

⏰ 11:00 - 12:45
Лабораторная
📝 2) Физика
Буренков Денис Сергеевич
2900
по нижней неделе

⏰ 13:00 - 14:45
Лекция
📝 Физика
Росанов Андрей Александрович
1поточная

⏰ 15:00 - 16:45
Лекция
📝 Математика
Широколобова Ольга Борисовна
1поточная
"""

schedule_tuesday4411 = """
Вторник
Группа 4411

⏰ 8:00 - 9:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Киселева Светлана Викторовна
Спортзал
29.04 и 27.05 занятий не будет

⏰ 10:00 - 11:45
📝 Практика учебная : Практика ознакомительная
Трофимов Павел Александрович
4423
только 03.06
"""
schedule_Wednesday4411 = """
Среда
Группа 4411

⏰ 9:00 - 10:45
Практика
📝 История России
Егорова Анастасия Васильевна
4412
по нижней неделе

⏰ 11:00 - 12:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по верхней неделе

⏰ 11:00 - 12:45
Лекция
📝 Теоретическая механика.
Кузнецов Николай Петрович
4405
по нижней неделе

⏰ 14:00 - 15:45
Практика
📝 Физика
Буренков Денис Сергеевич
2904

⏰ 16:00 - 18:45
Практика
📝 Математика
Широколобова Ольга Борисовна
3207
"""

schedule_thursday4411 = """
Пятница
Группа 4411

📝 Проектные дни
28.02; 28.03  02.05 и 30.05  занятий не будет

⏰ 9:00 - 10:45
Практика
📝 Русский язык и культура речи
Макаров Владлен Иванович
28.02; 28.03  02.05 и 30.05  занятий не будет

⏰ 9:00 - 10:45
Практика
📝 Русский язык и культура речи
Макаров Владлен Иванович
https://us05web.zoom.us/j/8409634063?pwd=QUR0cVU1WTF4Q3pPSzhpQ1R0L2Vvdz09

⏰ 12:00 - 13:45
Практика
📝 Теоретическая механика
Кузнецов Николай Петрович
4405
по нижней неделе. 28.02 и 28.03 занятий не будет

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе. 02.05 и 30.05 занятий не будет, до 9 недели

⏰ 15:00 - 16:45
Практика
📝 Иностранный язык
Лебедева Елена Анатольевна
1331
англ.язык. ИГУМ Антоново по нижней неделе. 28.02 и 28.03 занятий не будет

⏰ 16:00 - 17:45
Практика
📝 Экономика
Веткина Анна Владимировна
1поточная.
по верхней неделе. 02.05 и 30.05 занятий не будет., до 9 недели
"""

schedule_friday4411 = """
Пятница
Группа 4411

📝 Проектные дни
28.02; 28.03  02.05 и 30.05  занятий не будет

⏰ 9:00 - 10:45
Практика
📝 Русский язык и культура речи
Макаров Владлен Иванович
28.02; 28.03  02.05 и 30.05  занятий не будет

⏰ 9:00 - 10:45
Практика
📝 Русский язык и культура речи
Макаров Владлен Иванович
https://us05web.zoom.us/j/8409634063?pwd=QUR0cVU1WTF4Q3pPSzhpQ1R0L2Vvdz09

⏰ 12:00 - 13:45
Практика
📝 Теоретическая механика
Кузнецов Николай Петрович
4405
по нижней неделе. 28.02 и 28.03 занятий не будет

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе. 02.05 и 30.05 занятий не будет, до 9 недели

⏰ 15:00 - 16:45
Практика
📝 Иностранный язык
Лебедева Елена Анатольевна
1331
англ.язык. ИГУМ Антоново по нижней неделе. 28.02 и 28.03 занятий не будет

⏰ 16:00 - 17:45
Практика
📝 Экономика
Веткина Анна Владимировна
1поточная.
по верхней неделе. 02.05 и 30.05 занятий не будет., до 9 недели
"""

schedule_saturday4411 = """
Суббота
Группа 4411

⏰ 15:00 - 16:45
📝 Экономика
Веткина Анна Владимировна
с использованием ДОТ, до 9 недели

⏰ 17:00 - 17:45
Лекция
📝 История России
Штрейс Денис Станиславович
с использованием ДОТ

⏰ 18:00 - 18:45
Практика
📝 История России
Егорова Анастасия Васильевна
с использованием ДОТ
"""

schedule_monday4406 = """
Понедельник
Группа 4406

⏰ 14:00 - 14:45
📝 Практика учебная : Практика проектная.
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=2125302

⏰ 17:00 - 19:45
Практика
📝 Иностранный язык в сфере профессиональной коммуникации
Данейкина Наталья Викторовна
3225
английский язык, по нижней неделе; ул. Большая Санкт-Петербургская, д.41
"""

schedule_tuesday4406 = """
Вторник
Группа 4406

⏰ 17:00 - 19:45
📝 Актуальные проблемы средового проектирования
Гаврилова Мария Юрьевна
5502
до 9 недели.; ул. Большая Санкт-Петербургская, д.41

⏰ 17:00 - 18:45
📝 Актуальные проблемы средового проектирования
Гаврилова Мария Юрьевна
5502
после 9 недели.; ул. Большая Санкт-Петербургская, д.41
"""

schedule_Wednesday4406 = """
Среда
Группа 4406

⏰ 17:00 - 19:45
📝 Айдентика в городской среде.
Пекшин Дмитрий Романович
5504
по верхней неделе; ул. Большая Санкт-Петербургская, д.41
"""

schedule_thursday4406 = """
Четверг
Группа 4406

⏰ 17:00 - 19:45
📝 Цветопластическое формирование городской среды.
Васильева Татьяна Леонидовна
5504
до 9 недели.; ул. Большая Санкт-Петербургская, д.41

⏰ 18:00 - 19:45
📝 Цветопластическое формирование городской среды.
Васильева Татьяна Леонидовна
5504
после 9 недели.; ул. Большая Санкт-Петербургская, д.41
"""

schedule_friday4406 = """
Пятница
Группа 4406

📍 День самостоятельной работы студента
"""

schedule_saturday4406 = """
Суббота
Группа 4406

⏰ 10:00 - 11:45
Практика
📝 Иностранный язык в сфере профессиональной коммуникации
Барышева Ангелина Алексеевна
1318
по нижней неделе; ИГУМ(Антоново)

⏰ 10:00 - 11:45
Практика
📝 Иностранный язык в сфере профессиональной коммуникации
Барышева Ангелина Алексеевна
по верхней неделе, с 22.02; с использованием ДОТ

⏰ 13:00 - 14:45
📝 Практика учебная : Практика педагогическая.
Гаврилова Мария Юрьевна
5502
только 07.06, ул. Большая Санкт-Петербургская, д.41

⏰ 15:00 - 16:45
📝 Практика производственная: Практика проектная.
Гаврилова Мария Юрьевна
5502
только 07.06, ул. Большая Санкт-Петербургская, д.41
"""

schedule_monday4405 = """
Понедельник
Группа 4405

⏰ 14:00 - 14:45
📝 Практика учебная : Практика проектная.
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=2125302

⏰ 17:00 - 19:45
Практика
📝 Иностранный язык в сфере профессиональной коммуникации
Данейкина Наталья Викторовна
3225
английский язык, по нижней неделе; ул. Большая Санкт-Петербургская, д.41
"""

schedule_tuesday4405 = """
Вторник
Группа 4405

⏰ 18:00 - 20:45
📝 Современные концепции в дизайне
Анфимова Екатерина Борисовна
4323
до 9 недели.; ул. Большая Санкт-Петербургская, д.41

⏰ 18:00 - 19:45
📝 Современные концепции в дизайне
Анфимова Екатерина Борисовна
4323
спосле 9 недели; ул. Большая Санкт-Петербургская, д.41
"""

schedule_Wednesday4405 = """
Среда
Группа 4405

⏰ 17:00 - 19:45
📝 Организация профессиональной деятельности дизайнера
Новикова Яна Владимировна
4323
до 9 недели.; ул. Большая Санкт-Петербургская, д.41

⏰ 17:00 - 18:45
📝 Организация профессиональной деятельности дизайнера
Новикова Яна Владимировна
4323
после 9 недели.; ул. Большая Санкт-Петербургская, д.41
"""

schedule_thursday4405 = """
Четверг
Группа 4405

⏰ 17:00 - 18:45
📝 Рекламные стратегии и технологии в дизайне
Олигеров Александр Романович
5503
ул. Большая Санкт-Петербургская, д.41
"""

schedule_friday4405 = """
Пятница
Группа 4405

📍 День самостоятельной работы студента
"""

schedule_saturday4405 = """
Суббота
Группа 4405

⏰ 10:00 - 11:45
Практика
📝 Иностранный язык в сфере профессиональной коммуникации
Барышева Ангелина Алексеевна
1318
по нижней неделе; ИГУМ(Антоново)

⏰ 10:00 - 11:45
Практика
📝 Иностранный язык в сфере профессиональной коммуникации
Барышева Ангелина Алексеевна
по верхней неделе, с 22.02; с использованием ДОТ

⏰ 13:00 - 14:45
📝 Практика учебная : Практика педагогическая.
Новикова Яна Владимировна
5504
только 07.06, ул. Большая Санкт-Петербургская, д.41

⏰ 15:00 - 16:45
📝 Практика производственная: Практика проектная.
Новикова Яна Владимировна
5504
только 07.06., ул. Большая Санкт-Петербургская, д.41
"""

schedule_monday4371 = """
Понедельник
Группа 4371

⏰ 11:00 - 14:45
Практика
📝 .Рисунок, живопись.
Соколова Дарья Валерьевна
4422/24
до 9 й  недели

⏰ 11:00 - 14:45
Практика
📝 .Рисунок и живопись.
Новикова Яна Владимировна
4422/24
с 10 й  недели

⏰ 16:00 - 17:45
Практика
📝 Иностранный язык
Яковлева Ирина Вячеславовна
1304
англ.язык   ИГУМ Антоново по нижней неделе
"""

schedule_tuesday4371 = """
Вторник
Группа 4371

⏰ 10:00 - 11:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Киселева Светлана Викторовна
Спортзал
25.02;  25.03; 29.04 и 27.05  занятий не будет

⏰ 13:00 - 14:45
📝 Математика и информатика
Ракова Марина Владимировна
4323
после 9 недели ауд.5413

⏰ 15:00 - 17:45
📝 Архитектурная колористика.
Анфимова Екатерина Борисовна
5504
"""

schedule_Wednesday4371 = """
Среда
Группа 4371

⏰ 9:00 - 11:45
📝 Основы архитектурно-дизайнерского проектирования.
Виноградова Татьяна Анатольевна
5501
до 9 й недели  + курс.проект

⏰ 9:00 - 11:45
📝 Основы архитектурно-дизайнерского проектирования.
Соколова Дарья Валерьевна
5501
с 10 й недели + курс.работа

⏰ 13:00 - 14:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по верхней неделе

⏰ 13:00 - 14:45
Практика
📝 История России
Штрейс Денис Станиславович
1поточная
по нижней неделе

⏰ 16:00 - 17:45
Практика
📝 Русский язык и культура речи
Макаров Владлен Иванович
https://us05web.zoom.us/j/8409634063?pwd=QUR0cVU1WTF4Q3pPSzhpQ1R0L2Vvdz09
"""

schedule_thursday4371 = """
Четверг
Группа 4371

📝 Проектные дни
27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 12:00 - 13:45
📝 Практика учебная: Практика ознакомительная (архитектурно-обмерная)
Гаврилов Алексей Михайлович
5504
только 05.06

⏰ 14:00 - 14:45
📝 Основы проектной деятельности.
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915Четверг
Группа 4371

📝 Проектные дни
27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 12:00 - 13:45
📝 Практика учебная: Практика ознакомительная (архитектурно-обмерная)
Гаврилов Алексей Михайлович
5504
только 05.06

⏰ 14:00 - 14:45
📝 Основы проектной деятельности.
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""
schedule_friday4371 = """
Пятница
Группа 4371

📝 Проектные дни
28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 9:00 - 11:45
Практика
📝 Основы архитектурно-дизайнерского проектирования.
Виноградова Татьяна Анатольевна
5501
до 9 недели . 28.02 ; 28.03   занятий не будет

⏰ 9:00 - 11:45
Практика
📝 Основы архитектурно-дизайнерского проектирования.
Соколова Дарья Валерьевна
5501
после 9 недели .  02.05 и 30.05 занятий не будет

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе, после 9 недели, 02.05 и 30.05 занятий не будет

⏰ 16:00 - 17:45
Практика
📝 Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе, после 9 недели,  02.05 и 30.05 занятий не будет
"""
schedule_saturday4371 = """
Суббота
Группа 4371

⏰ 10:00 - 11:45
Практика
📝 Иностранный язык
Барышева Ангелина Алексеевна
1318
нем.язык  ИГУМ Антоново   по верхней неделе

⏰ 10:00 - 11:45
Практика
📝 Иностранный язык
Барышева Ангелина Алексеевна
по нижней неделе   с использованием ДОТ

⏰ 13:00 - 14:45
📝 Экономика
Веткина Анна Владимировна
с использованием ДОТ, после 9 недели
"""

schedule_monday4312 = """
Понедельник
Группа 4312

⏰ 9:00 - 10:45
Лекция
📝 Информатика
Неустроева Светлана Викторовна
4поточная
по верхней неделе

⏰ 9:00 - 10:45
Лекция
📝 Математический анализ.
Матвеева Ольга Павловна
4поточная
по нижней неделе

⏰ 11:00 - 11:45
Лекция
📝 Математический анализ.
Матвеева Ольга Павловна
4поточная
03 февраля занятий не будет

⏰ 12:00 - 13:45
Лекция
📝 Дискретная математика
Едемский Владимир Анатольевич
4поточная

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Киварина Мария Валентиновна
5поточная
с 24.02  ул.Б.Санкт-Петербургская д.41; по нижней неделе
"""

schedule_tuesday4312 = """
Вторник
Группа 4312

⏰ 10:00 - 12:45
Практика
📝 Дискретная математика
Кунин Константин Вячеславович
1307

⏰ 14:00 - 16:45
📝 Информатика
Неустроева Светлана Викторовна
2309
01.04 занятий не будет
"""

schedule_Wednesday4312 = """
Среда
Группа 4312

⏰ 10:00 - 11:45
Практика
🏀 Физическая культура и спорт (элективный курс).
Спортзал
26.02; 26.03; 30.04 и 28.05 занятий не будет

⏰ 12:00 - 12:45
Лекция
📝 Теория алгоритмов.
Тихомиров Алексей Сергеевич
5поточная

⏰ 13:00 - 15:45
Практика
📝 Теория алгоритмов.
Тихомиров Алексей Сергеевич
3305
"""

schedule_thursday4312 = """
Четверг
Группа 4312

⏰ 8:00 - 8:45
Лекция
📝 Алгебра, геометрия и математическая логика
Неустроев Николай Васильевич
4поточная

⏰ 9:00 - 9:45
📝 Проектный день
27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 9:00 - 11:45
Практика
📝 Математический анализ
Матвеева Ольга Павловна
3300
27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 12:00 - 12:45
Лекция
📝 История России
Федорук Наталья Сергеевна
4поточная
ул.Б. Санкт-Петербургская д.41 ;  27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 14:00 - 14:45
📝 Основы проектной деятельности.. Встреча с наставником
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4312 = """
Пятница
Группа 4312

⏰ 8:00 - 9:45
Практика
📝 Алгебра, геометрия и математическая логика
Неустроев Николай Васильевич
1316
28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 9:00 - 9:45
📝 Проектный день
28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 10:00 - 10:45
Практика
📝 История России
Ильина И. С.
1316
ул.Б. Санкт-Петербургская д.41 ;  28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 12:00 - 13:45
Практика
📝 1) Иностранный язык
Яковлева Ирина Вячеславовна
1304
англ.язык. Антоново ИГУМ  по верхней неделе  . 02.05 и 30.05 занятий не будет

⏰ 12:00 - 13:45
Практика
📝 2) Иностранный язык
Костина Нина Николаевна
1321ИГУМ
англ.язык .Антоново ИГУМ . по верхней неделе 02.05 и 30.05 занятий не будет

⏰ 14:00 - 15:45
Практика
📝 Экономика
Киварина Мария Валентиновна
203
с 07.03  ИГУМ Антоново  по верхней неделе . 28.02; 28.03 занятий не будет
"""

schedule_saturday4312 = """
Суббота
Группа 4312

⏰ 10:00 - 11:45
📝 История России
с использованием ДОТ

⏰ 12:00 - 13:45
Практика
📝 Иностранный язык
англ.язык.  с использованием ДОТ   по нижней неделе

⏰ 14:00 - 15:45
Практика
📝 Экономика
Киварина Мария Валентиновна
с использованием ДОТ  с  24.03 по нижней неделе
"""

schedule_monday4311 = """
Понедельник
Группа 4311

⏰ 9:00 - 10:45
Лекция
📝 Информатика
Неустроева Светлана Викторовна
4поточная
по верхней неделе

⏰ 9:00 - 10:45
Лекция
📝 Математический анализ.
Матвеева Ольга Павловна
4поточная
по нижней неделе

⏰ 11:00 - 11:45
Лекция
📝 Математический анализ
Матвеева Ольга Павловна
4поточная
03  февраля занятий не будет

⏰ 12:00 - 13:45
Лекция
📝 Дискретная математика
Едемский Владимир Анатольевич
4поточная

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Киварина Мария Валентиновна
5поточная
с 24.02  ул.Б.Санкт-Петербургская д.41; по нижней неделе

⏰ 19:00 - 20:45
Практика
📝 Иностранный язык
Корнева Юлия Геннадьевна
6401
Русский язык для иностранных студентов
"""

schedule_tuesday4311 = """
Вторник
Группа 4311

⏰ 9:00 - 11:45
Практика
📝 Математический анализ.
Матвеева Ольга Павловна
1311
04 февраля  занятий не будет

⏰ 12:00 - 14:45
Практика
📝 Дискретная математика
Едемский Владимир Анатольевич
1316
"""

schedule_Wednesday4311 = """
Среда
Группа 4311

⏰ 10:00 - 11:45
Практика
🏀 Физическая культура и спорт (элективный курс).
Спортзал
26.02; 26.03; 30.04 и 28.05 занятий не будет

⏰ 12:00 - 12:45
Лекция
📝 Теория алгоритмов.
Тихомиров Алексей Сергеевич
5поточная

⏰ 13:00 - 15:45
📝 Информатика
Неустроева Светлана Викторовна
2309
02.04.  занятий не будет
"""

schedule_thursday4311 = """
Четверг
Группа 4311

⏰ 8:00 - 8:45
Лекция
📝 Алгебра, геометрия и математическая логика
Неустроев Николай Васильевич
4поточная

⏰ 9:00 - 9:45
📝 Проектные дни
27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 10:00 - 11:45
Практика
📝 Алгебра, геометрия и математическая логика
Неустроев Николай Васильевич
1316
27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 12:00 - 12:45
Лекция
📝 История России
Федорук Наталья Сергеевна
4поточная
ул.Б. Санкт-Петербургская д.41 ;  27.02 ; 27.03; 01.05 и 29.05 занятий не будет

⏰ 14:00 - 14:45
📝 Основы проектной деятельности.. Встреча с наставником
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4311 = """
Пятница
Группа 4311

⏰ 9:00 - 9:45
📝 Проектные  дни
28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 9:00 - 9:45
Практика
📝 История России
Ильина И. С.
1303
ул.Б. Санкт-Петербургская д.41 ;  28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 10:00 - 12:45
Практика
📝 Теория алгоритмов.
Тихомиров Алексей Сергеевич
3305
28.02 ; 28.03; 02.05 и 30.05 занятий не будет

⏰ 14:00 - 15:45
Практика
📝 1) Иностранный язык
Яковлева Ирина Вячеславовна
1304
англ.язык. Антоново ИГУМ  по верхней неделе  . 02.05 и 30.05 занятий не будет

⏰ 14:00 - 15:45
Практика
📝 2) Иностранный язык
Костина Нина Николаевна
1321ИГУМ
англ.язык .Антоново ИГУМ . по верхней неделе 02.05 и 30.05 занятий не будет

⏰ 14:00 - 15:45
Практика
📝 Экономика
Киварина Мария Валентиновна
5поточная
с  14.03  ул.Б.Санкт-Петербургская д.41  по нижней неделе . 28.02; 28.03 занятий не будет
"""

schedule_saturday4311 = """
Суббота
Группа 4311

⏰ 10:00 - 11:45
📝 История России
с использованием ДОТ

⏰ 12:00 - 13:45
Практика
📝 Иностранный язык
англ.язык.  с использованием ДОТ   по нижней неделе

⏰ 14:00 - 15:45
Практика
📝 Экономика
Киварина Мария Валентиновна
с использованием ДОТ  с 24.03 по нижней неделе
"""

# Продолжение для других групп...
schedule_monday4091 = """
Понедельник
Группа 4091

⏰ 15:00 - 15:45
Лекция
📝 1) Информационные технологии
Архипова Гелиря Асхатовна
4207

⏰ 16:00 - 16:45
Лекция
📝 1) Информационные технологии
Архипова Гелиря Асхатовна
4207
с 31.03

⏰ 17:00 - 18:45
Лабораторная
📝 2) Архитектура ЭВМ и периферийных устройств
Эрштейн Леонид Борисович
3317
Кафедра информационных технологий и систем

⏰ 17:00 - 18:45
Лабораторная
📝 1) Архитектура ЭВМ и периферийных устройств
Савинова Марина Александровна
109
ПК
"""

schedule_tuesday4091 = """
Вторник
Группа 4091

⏰ 10:00 - 11:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Пахомов Алексей Геннадьевич
Спортзал

⏰ 12:00 - 13:45
Лекция
📝 Математика
Матвеева Ольга Павловна
4поточная

⏰ 15:00 - 16:45
Лабораторная
📝 Основы программирования: Алгоритмические языки и программирование.
Винник Людмила Ивановна
3315
"""

schedule_wednesday4091 = """
Среда
Группа 4091

⏰ 9:00 - 10:45
Практика
📝 Информационные технологии
Архипова Гелиря Асхатовна
3312
с 12.03 по 23.04

⏰ 9:00 - 10:45
📝 Практика учебная: Практика ознакомительная.
Архипова Гелиря Асхатовна
3312
с 30.04

⏰ 11:00 - 12:45
Лекция
📝 2) Информационные технологии
Архипова Гелиря Асхатовна
4207

⏰ 14:00 - 16:45
Практика
📝 Основы программирования: Алгоритмические языки и программирование.
Винник Людмила Ивановна
3315
"""

schedule_thursday4091 = """
Четверг
Группа 4091

⏰ 9:00 - 10:45
Практика
📝 1) Иностранный язык
Костина Нина Николаевна
1331
ИГУМ, англ.яз, по верхней неделе

⏰ 9:00 - 10:45
Практика
📝 2) Иностранный язык
Лебедева Елена Анатольевна
1313
ИГУМ, англ.яз, по верхней неделе

⏰ 12:00 - 14:45
Практика
📝 Математика
Матвеева Ольга Павловна
1311

⏰ 15:00 - 16:45
Лекция
📝 Основы программирования: Алгоритмические языки и программирование.
Винник Людмила Ивановна
4поточная
по верхней неделе

⏰ 15:00 - 16:45
Лекция
📝 Основы программирования: Алгоритмические языки и программирование.
Винник Людмила Ивановна
4поточная
Кафедра информационных технологий и систем

⏰ 19:00 - 19:45
Практика
📝 1) Иностранный язык
Костина Нина Николаевна
с использованием ДОТ

⏰ 19:00 - 19:45
Практика
📝 2) Иностранный язык
Лебедева Елена Анатольевна
с использованием ДОТ
"""

schedule_friday4091 = """
Пятница
Группа 4091

⏰ 10:00 - 11:45
Лекция
📝 История России
Федорук Наталья Сергеевна
1поточная
по нижней неделе

⏰ 10:00 - 11:45
Лекция
📝 Экономика
Киварина Мария Валентиновна
1поточная
по верхней неделе

⏰ 14:00 - 16:45
Лекция
📝 Архитектура ЭВМ и периферийных устройств
Шаклеин В. Г.
Кафедра информационных технологий и систем

⏰ 19:00 - 19:45
Лекция
📝 История России
Федорук Наталья Сергеевна
с использованием ДОТ
"""

schedule_saturday4091 = """
Суббота
Группа 4091

⏰ 10:00 - 11:45
Практика
📝 Экономика
Киварина Мария Валентиновна
3311
по нижней неделе

⏰ 12:00 - 13:45
Практика
📝 История России
Борисевич Даниил Андреевич
4поточная
по нижней неделе

⏰ 13:00 - 14:45
Практика
📝 3) Иностранный язык
Барышева Ангелина Алексеевна
1218
ИГУМ, нем.яз, по верхней неделе

⏰ 17:00 - 18:45
📝 Экономика
Киварина Мария Валентиновна
с использованием ДОТ

⏰ 19:00 - 19:45
Практика
📝 История России
Борисевич Даниил Андреевич
с использованием ДОТ

⏰ 20:00 - 20:45
Практика
📝 3) Иностранный язык
Барышева Ангелина Алексеевна
с использованием ДОТ
"""

# Продолжение для других групп...
schedule_monday4075 = """
Понедельник
Группа 4075

⏰ 14:00 - 15:45
📝 Практика производственная: Практика проектная
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=2125302

⏰ 16:00 - 17:45
Лекция
📝 Проектирование строительных конструкций с использованием программного комплекса SCAD Office
Петров Михаил Юрьевич
5309
+ курсовой проект

⏰ 18:00 - 19:45
📝 Практика учебная: Научно-исследовательская работа (получение первичных навыков научно-исследовательской работы)
Хузин Зуфар Миргазямович
5209
"""

schedule_tuesday4075 = """
Вторник
Группа 4075

⏰ 16:00 - 17:45
📝 Технология и организация строительства уникальных зданий и сооружений
Хузин Зуфар Миргазямович
5209

⏰ 18:00 - 19:45
Практика
📝 1) Иностранный язык в сфере профессиональной коммуникации
Данейкина Наталья Викторовна
3225
англ.яз
"""

schedule_wednesday4075 = """
Среда
Группа 4075

⏰ 17:00 - 18:45
Практика
📝 Проектирование строительных конструкций с использованием программного комплекса SCAD Office
Петров Михаил Юрьевич
5309
+ курсовой проект
"""

schedule_thursday4075 = """
Четверг
Группа 4075

⏰ 17:00 - 18:45
📝 Психология руководителя и межкультурное взаимодействие
Герасимов Александр Викторович
5302
"""

schedule_friday4075 = """
Пятница
Группа 4075

⏰ 16:00 - 18:45
📝 Информационное моделирование объектов промышленного и гражданского строительства
Вареник Кирилл Александрович
5310
+ курсовой проект
"""

schedule_saturday4075 = """
Суббота
Группа 4075

⏰ 10:00 - 11:45
Практика
📝 2) Иностранный язык в сфере профессиональной коммуникации
Барышева Ангелина Алексеевна
1318
ИГУМ, нем.яз
"""

# Продолжение для других групп...
schedule_monday4071 = """
Понедельник
Группа 4071

⏰ 9:00 - 10:45
Лекция
📝 Геодезия в строительстве
Фиников Дмитрий Анатольевич
5203

⏰ 11:00 - 11:45
Лекция
📝 Теоретическая механика
Нозирзода Шодмон Салохидин
4415

⏰ 12:00 - 13:45
Практика
📝 Теоретическая механика
Нозирзода Шодмон Салохидин
4415

⏰ 15:00 - 16:45
📝 Практика учебная: Практика изыскательская.
Романовская Людмила Николаевна
5302
только 02.06
"""

schedule_tuesday4071 = """
Вторник
Группа 4071

⏰ 10:00 - 11:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Андреева Юлия Сергеевна
Спортзал

⏰ 12:00 - 12:45
Практика
📝 Геодезия в строительстве
Фиников Дмитрий Анатольевич
5203

⏰ 13:00 - 14:45
Лабораторная
📝 Геодезия в строительстве
Фиников Дмитрий Анатольевич
5203

⏰ 16:00 - 17:45
📝 Математика
Широколобова Ольга Борисовна
3207
"""

schedule_wednesday4071 = """
Среда
Группа 4071

⏰ 9:00 - 10:45
Лекция
📝 Химия
Ульянова Надежда Ильинична
1поточная
до 9 недели

⏰ 11:00 - 12:45
Практика
📝 Русский язык и культура речи.
Федорук Александра Вадимовна
4402

⏰ 13:00 - 14:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по верхней неделе

⏰ 14:00 - 15:45
Практика
📝 1) Иностранный язык
Яковлева Ирина Вячеславовна
1304
ИГУМ, англ.яз., по нижней неделе

⏰ 15:00 - 16:45
Практика
📝 История России
Штрейс Денис Станиславович
1поточная
по верхней неделе
"""

schedule_thursday4071 = """
Четверг
Группа 4071

📝 Проектный день
только 27.02; 27.03;01.05 и 29.05

⏰ 9:00 - 10:45
Практика
📝 2) Иностранный язык
Барышева Ангелина Алексеевна
1318
ИГУМ, нем.яз., по верхней неделе

⏰ 9:00 - 10:45
Практика
📝 2) Иностранный язык
Барышева Ангелина Алексеевна
с использованием ДОТ, по нижней неделе

⏰ 9:00 - 10:45
Практика
📝 1) Иностранный язык
Яковлева Ирина Вячеславовна
с использованием ДОТ, по нижней неделе

⏰ 11:00 - 12:45
📝 История России
Штрейс Денис Станиславович
с использованием ДОТ

⏰ 14:00 - 14:45
📝 Основы проектной деятельности
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4071 = """
Пятница
Группа 4071

📝 Проектный день
только 28.02; 28.03 02.05 и 30.05

⏰ 11:00 - 12:45
📝 Химия
Ульянова Надежда Ильинична
203хк
ХТИ, 28.02; 28.03 02.05 и 30.05 занятий не будет

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе, после 9 недели

⏰ 14:00 - 15:45
Практика
📝 Экономика
Веткина Анна Владимировна
1поточная
по нижней неделе, после 9 недели

⏰ 17:00 - 18:45
📝 Экономика
Веткина Анна Владимировна
с использованием ДОТ, после 9 недели
"""

schedule_saturday4071 = """
Суббота
Группа 4071

📍 День самостоятельной работы студентов
"""

# Продолжение для других групп...
schedule_monday4061 = """
Понедельник
Группа 4061

⏰ 9:00 - 10:45
Практика
📝 Иностранный язык
Лопачев Артём Олегович
1321ИГУМ
англ.язык  ИГУМ Антоново  по верхней неделе

⏰ 11:00 - 12:45
Практика
📝 Развитие и современное состояние автомобилестроения
Чадин Александр Николаевич
4222
по нижней неделе

⏰ 13:00 - 14:45
Лекция
📝 Физика
Росанов Андрей Александрович
1поточная

⏰ 15:00 - 16:45
Лекция
📝 Математика
Широколобова Ольга Борисовна
1поточная
"""

schedule_tuesday4061 = """
Вторник
Группа 4061

⏰ 8:00 - 9:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Андреева Юлия Сергеевна
Спортзал
25.02; 25.03; 29.04 и 27.05 занятий не будет

⏰ 10:00 - 12:45
Лекция
📝 Математика
Петрова Юлия Юрьевна
4223

⏰ 14:00 - 15:45
Практика
📝 Иностранный язык
Лопачев Артём Олегович
англ.язык   с использованием ДОТ  по нижней неделе
"""

schedule_wednesday4061 = """
Среда
Группа 4061

⏰ 9:00 - 10:45
Лекция
📝 Химия
Ульянова Надежда Ильинична
1поточная
до 9 недели

⏰ 11:00 - 12:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по верхней неделе

⏰ 11:00 - 12:45
Практика
📝 История России
Егорова Анастасия Васильевна
4412
по нижней неделе

⏰ 13:00 - 14:45
Практика
📝 Русский язык и культура речи
Федорук Александра Вадимовна
4402

⏰ 16:00 - 17:45
Лекция
📝 Развитие и современное состояние автомобилестроения
Чадин Александр Николаевич
4222
по верхней неделе
"""

schedule_thursday4061 = """
Четверг
Группа 4061

📝 Проектные дни
27.02; 27.03; 01.05 и 29.05 занятий не будет

⏰ 9:00 - 10:45
Практика
📝 Физика
Буренков Денис Сергеевич
2808
27.02; 27.03; 01.05 и 29.05 занятий не будет

⏰ 11:00 - 12:45
📝 Практика учебная : Практика ознакомительная.
Бойко А. Д.
4229
с 13.02; 27.02; 27.03; 01.05 и 29.05 занятий не будет

⏰ 14:00 - 14:45
Практика
📝 Основы проектной деятельности
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4061 = """
Пятница
Группа 4061

📝 Проектные дни
28.02; 28.03; 02.05 и 30.05 занятий не будет

⏰ 9:00 - 10:45
📝 Химия
Ульянова Надежда Ильинична
203хк
ул. Советской Армии  д.7   . 28.02; 28.03; 02.05 и 30.05 занятий не будет

⏰ 12:00 - 13:45
Лабораторная
📝 Физика
Росанов Андрей Александрович
2900
по верхней неделе   02.05 и 30.05 занятий не будет

⏰ 12:00 - 13:45
Практика
📝 Экономика
Веткина Анна Владимировна
1поточная
по нижней неделе  .28.02 и 28.03 занятий не будет, до 9 недели

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе  02.05 и 30.05 занятий не будет, до 9 недели
"""

schedule_saturday4061 = """
Суббота
Группа 4061

⏰ 13:00 - 13:45
Лекция
📝 История России
Штрейс Денис Станиславович
с использованием ДОТ

⏰ 13:00 - 13:45
Практика
📝 История России
Егорова Анастасия Васильевна
с использованием ДОТ

⏰ 16:00 - 17:45
📝 Экономика
Веткина Анна Владимировна
с использованием ДОТ, до 9 недели """


schedule_monday4042 = """
Понедельник
Группа 4042

⏰ 13:00 - 14:45
Лекция
📝 Физика
Росанов Андрей Александрович
1поточная

⏰ 15:00 - 16:45
Лекция
📝 Математика
Широколобова Ольга Борисовна
1поточная

⏰ 17:00 - 18:45
Практика
📝 Русский язык и культура речи
Корнева Юлия Геннадьевна
6401
только для иностранных студентов

⏰ 19:00 - 20:45
Практика
📝 Иностранный язык
Корнева Юлия Геннадьевна
6401
(русский язык как иностранный язык) только для иностранных студентов
"""

schedule_tuesday4042 = """
Вторник
Группа 4042

⏰ 9:00 - 10:45
Практика
📝 1) Иностранный язык
Лопачев Артём Олегович
1331
англ.язык  ИГУМ Антоново по верхней неделе

⏰ 9:00 - 10:45
Практика
📝 2) Иностранный язык
Лопачев Артём Олегович
1331
англ.язык  ИГУМ Антоново по нижней неделе

⏰ 12:00 - 13:45
Практика
📝 Физика
Росанов Андрей Александрович
2904

⏰ 14:00 - 15:45
Практика
📝 Инженерная и компьютерная графика
Козлова Ирина Витальевна
5414

⏰ 16:00 - 16:45
Практика
📝 Инженерная и компьютерная графика
Козлова Ирина Витальевна
5414
по верхней неделе
"""

schedule_wednesday4042 = """
Среда
Группа 4042

⏰ 8:00 - 9:45
Практика
🏀 Физическая культура и спорт (элективный курс)
Киселева Светлана Викторовна
Спортзал
26.02 ;26.03; 30.04 и 28.05 занятий не будет

⏰ 11:00 - 12:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по верхней неделе

⏰ 11:00 - 12:45
Лекция
📝 История России
Штрейс Денис Станиславович
1поточная
по  нижней неделе

⏰ 13:00 - 15:45
Практика
📝 Математика
Петрова Юлия Юрьевна
3207
"""

schedule_thursday4042 = """
Четверг
Группа 4042

📝 Проектный день
27.02; 27.03; 01.05 и 29.05  занятий не будет

⏰ 10:00 - 12:45
Практика
📝 Инженерная и компьютерная графика
Гуляев Вадим Игоревич
5413
по верхней неделе    01.05 и 29.05  занятий не будет

⏰ 11:00 - 12:45
📝 Практика учебная : Практика ознакомительная.
Нозирзода Шодмон Салохидин
4405
только 05.06

⏰ 14:00 - 14:45
Практика
📝 Основы проектной деятельности    Встреча с наставником.
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4042 = """
Пятница
Группа 4042

📝 Проектный день
28.02; 28.03; 02.05 и  30. 05  занятий не будет

⏰ 10:00 - 11:45
Лабораторная
📝 1) Физика
Росанов Андрей Александрович
2900
по верхней неделе  02.05 и 30.05  занятий не будет

⏰ 10:00 - 11:45
Лабораторная
📝 2) Физика
Росанов Андрей Александрович
2900
по  нижней неделе     28.02 и 28.03  занятий не будет

⏰ 10:00 - 11:45
Лабораторная
📝 3) Физика
Буренков Денис Сергеевич
2909
по  верхней неделе   02.05  и 30.05 занятий не будет

⏰ 12:00 - 13:45
Практика
📝 Русский язык и культура речи
Федорук Александра Вадимовна
4402
28.02; 28.03; 02.05 и  30. 05  занятий не будет

⏰ 14:00 - 15:45
Лекция
📝 Экономика
Веткина Анна Владимировна
1поточная
по верхней неделе   02.05   и 30.05   занятий не будет, до 9 недели

⏰ 14:00 - 15:45
Практика
📝 Экономика
Веткина Анна Владимировна
1поточная
по  нижней неделе   28.02 и 28.03  занятий не будет, до 9 недели

⏰ 17:00 - 18:45
📝 История России
Штрейс Денис Станиславович
с использованием ДОТ
"""

schedule_saturday4042 = """
Суббота
Группа 4042

⏰ 15:00 - 16:45
📝 Экономика
Веткина Анна Владимировна
с использованием ДОТ, до 9 недели

⏰ 17:00 - 18:45
Практика
📝 Иностранный язык
Лопачев Артём Олегович
по верхней неделе англ.язык   с использованием ДОТ
"""

# Группа 4041 (без занятий)
schedule_monday4041 = """
Понедельник
Группа 4041

📍 Занятий нет
"""

schedule_tuesday4041 = """
Вторник
Группа 4041

📍 Занятий нет
"""

schedule_wednesday4041 = """
Среда
Группа 4041

📍 Занятий нет
"""

schedule_thursday4041 = """
Четверг
Группа 4041

📍 Занятий нет
"""

schedule_friday4041 = """
Пятница
Группа 4041

📍 Занятий нет
"""

schedule_saturday4041 = """
Суббота
Группа 4041

📍 Занятий нет
"""

# Группа 4035
schedule_monday4035 = """
Понедельник
Группа 4035

⏰ 11:00 - 12:45
Практика
📝 Практика производственная: Научно-исследовательская работа
Петров Михаил Николаевич
1321ПТИ

⏰ 14:00 - 14:45
Практика
📝 Практика учебная : Практика проектная
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=2125302
"""

schedule_tuesday4035 = """
Вторник
Группа 4035

📍 День самостоятельной работы студента
"""

schedule_wednesday4035 = """
Среда
Группа 4035

⏰ 9:00 - 10:45
Практика
📝 Практика производственная: Научно-исследовательская работа
Захаров Максим Анатольевич
1324

⏰ 11:00 - 13:45
📝 Проектирование и технология электронной компонентной базы
Петров Михаил Николаевич
1321ПТИ

⏰ 14:00 - 15:45
Практика
📝 Практика производственная: Практика технологическая
Захаров Максим Анатольевич
1324

⏰ 14:00 - 15:45
Практика
📝 Практика производственная: Практика технологическая
Петров Михаил Николаевич
1321ПТИ

⏰ 18:00 - 19:45
Практика
📝 Практика учебная : Практика педагогическая
Телина Ирина Сергеевна
1313ПТИ
"""

schedule_thursday4035 = """
Четверг
Группа 4035

⏰ 11:00 - 13:45
📝 Физика и технология сверхвысокочастотных микроэлектронных приборов
Драгуть Максим Викторович
1313ПТИ

⏰ 14:00 - 15:45
Практика
📝 Иностранный язык для научно-исследовательской работы
Петров Михаил Николаевич
1321ПТИ
"""

schedule_friday4035 = """
Пятница
Группа 4035

⏰ 15:00 - 16:45
Практика
📝 Практика производственная: Практика технологическая
Телина Ирина Сергеевна
1324

⏰ 15:00 - 16:45
Практика
📝 Практика производственная: Научно-исследовательская работа
Телина Ирина Сергеевна
1324
"""

schedule_saturday4035 = """
Суббота
Группа 4035

📍 День самостоятельной работы студента
"""

# Группа 4026
schedule_monday4026 = """
Понедельник
Группа 4026

⏰ 13:00 - 14:45
Лекция
📝 Микроэлектроника сверхвысоких частот
Петров Роман Валерьевич
2609

⏰ 15:00 - 15:45
Практика
📝 Практика учебная : Практика проектная
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=2125302
"""

schedule_tuesday4026 = """
Вторник
Группа 4026

⏰ 15:00 - 17:45
Практика
📝 Иностранный язык для научно-исследовательской работы
Данейкина Наталья Викторовна
2609
по нижней неделе

⏰ 18:00 - 19:45
Практика
📝 Практика производственная: Научно-исследовательская работа
Семенов Геннадий Алексеевич
2602
"""

schedule_wednesday4026 = """
Среда
Группа 4026

⏰ 13:00 - 14:45
Практика
📝 Микроэлектроника сверхвысоких частот
Петров Роман Валерьевич
2609

⏰ 16:00 - 17:45
📝 Коммерциализация результатов научных исследований и разработок
Хаванова Марина Александровна
2601

⏰ 18:00 - 19:45
Практика
📝 Практика производственная: Практика проектно-технологическая
Хаванова Марина Александровна
2601
"""

schedule_thursday4026 = """
Четверг
Группа 4026

⏰ 9:00 - 10:45
Практика
📝 Практика производственная: Практика проектно-технологическая
Семенов Геннадий Алексеевич
2602
"""

schedule_friday4026 = """
Пятница
Группа 4026

⏰ 9:00 - 11:45
📝 Электромагнитная совместимость в конструкциях систем радиоэлектронной борьбы
Шадурский П. В.
с 21.02. завод Квант
"""

schedule_saturday4026 = """
Суббота
Группа 4026

📍 День самостоятельной работы студента
"""

schedule_monday4025 = """
Понедельник
Группа 4025

⏰ 13:00 - 14:45
Лекция
 Микроэлектроника сверхвысоких частот
Петров Роман Валерьевич
2609

⏰ 15:00 - 15:45
Практика
 Практика учебная : Практика проектная
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=2125302
"""

schedule_tuesday4025 = """
Вторник
Группа 4025

⏰ 15:00 - 17:45
Практика
 Иностранный язык для научно-исследовательской работы
Данейкина Наталья Викторовна
2609
по нижней неделе

⏰ 18:00 - 19:45
Практика
 Практика производственная: Научно-исследовательская работа
Семенов Геннадий Алексеевич
2602
"""

schedule_wednesday4025 = """
Среда
Группа 4025

⏰ 13:00 - 14:45
Практика
 Микроэлектроника сверхвысоких частот
Петров Роман Валерьевич
2609

⏰ 16:00 - 17:45
 Коммерциализация результатов научных исследований и разработок
Хаванова Марина Александровна
2601

⏰ 18:00 - 19:45
Практика
 Практика производственная: Практика проектно-технологическая
Хаванова Марина Александровна
2601
"""

schedule_thursday4025 = """
Четверг
Группа 4025

⏰ 9:00 - 10:45
Практика
 Практика производственная: Практика проектно-технологическая
Семенов Геннадий Алексеевич
2602
"""

schedule_friday4025 = """
Пятница
Группа 4025

⏰ 15:00 - 17:45
 Проектирование микрорадиоэлектронных средств
Семенов Геннадий Алексеевич
2609
с 07.03.
"""

schedule_saturday4025 = """
Суббота
Группа 4025

 День самостоятельной работы студента
"""


schedule_monday4022 = """
Понедельник
Группа 4022

Занятий нет
"""

schedule_tuesday4022 = """
Вторник
Группа 4022

Занятий нет
"""

schedule_wednesday4022 = """
Среда
Группа 4022

Занятий нет
"""

schedule_thursday4022 = """
Четверг
Группа 4022

Занятий нет
"""

schedule_friday4022 = """
Пятница
Группа 4022

Занятий нет
"""

schedule_saturday4022 = """
Суббота
Группа 4022

Занятий нет
"""

schedule_monday4016 = """
Понедельник
Группа 4016

⏰ 14:00 - 14:45
Практика
 Практика учебная : Практика проектная
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=2125302
"""

schedule_tuesday4016 = """
Вторник
Группа 4016

⏰ 15:00 - 16:45
 Программная инженерия систем обработки локационной информации на ПЛИС
Трофимов Александр Михайлович
2.61
ИНТЦ-Валдай, Великая, 18а

⏰ 17:00 - 19:45
 Искусственный интеллект в задачах обработки данных
Вахлачев Николай Владимирович
2.13.1
ИНТЦ-Валдай, Великая, 18а
"""

schedule_wednesday4016 = """
Среда
Группа 4016

⏰ 14:00 - 15:45
 САПР схемотехнических решений
Пешутин Д. С.
2810

⏰ 16:00 - 17:45
Практика
 Практика учебная : Научно-исследовательская работа (получение первичных навыков научно-исследовательской работы)
Зинченко Александр Андреевич
2708
"""

schedule_thursday4016 = """
Четверг
Группа 4016

⏰ 14:00 - 15:45
Практика
 Иностранный язык для научно-исследовательской работы
Трофимов Александр Михайлович
2.61

⏰ 17:00 - 18:45
 Управление качеством в радиоэлектронике
Бекмансуров Мансур Саляхутдинович
2705
"""

schedule_friday4016 = """
Пятница
Группа 4016

⏰ 16:00 - 16:45
Практика
 Междисциплинарный проект
Жукова Ирина Николаевна
2810

⏰ 17:00 - 18:45
Практика
 Компьютерное моделирование радиоэлектронных устройств и систем
Жукова Ирина Николаевна
2810
"""

schedule_saturday4016 = """
Суббота
Группа 4016

 День самостоятельной работы студента
"""

schedule_monday4015 = """
Понедельник
Группа 4015

⏰ 14:00 - 14:45
Практика
 Практика учебная : Практика проектная
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=2125302
"""

schedule_tuesday4015 = """
Вторник
Группа 4015

⏰ 15:00 - 16:45
 Проектирование телекоммуникационных систем на ПЛИС
Трофимов Александр Михайлович
2.61
ИНТЦ-Валдай, Великая, 18а

⏰ 17:00 - 19:45
 Искусственный интеллект в задачах обработки данных
Вахлачев Николай Владимирович
2.13.1
ИНТЦ-Валдай, Великая, 18а
"""

schedule_wednesday4015 = """
Среда
Группа 4015

⏰ 14:00 - 15:45
 САПР в электронике
Пешутин Д. С.
2810

⏰ 16:00 - 17:45
Практика
 Практика учебная : Научно-исследовательская работа (получение первичных навыков научно-исследовательской работы)
Зинченко Александр Андреевич
2708
"""

schedule_thursday4015 = """
Четверг
Группа 4015

⏰ 14:00 - 15:45
Практика
 Иностранный язык для научно-исследовательской работы
Трофимов Александр Михайлович
2.61

⏰ 17:00 - 18:45
 Управление качеством в радиоэлектронике
Бекмансуров Мансур Саляхутдинович
2705
"""

schedule_friday4015 = """
Пятница
Группа 4015

⏰ 16:00 - 16:45
Практика
 Междисциплинарный проект
Жукова Ирина Николаевна
2810

⏰ 17:00 - 18:45
Практика
 Компьютерное моделирование радиоэлектронных устройств и систем
Жукова Ирина Николаевна
2810
"""

schedule_saturday4015 = """
Суббота
Группа 4015

 День самостоятельной работы студента
"""

schedule_monday4012 = """
Понедельник
Группа 4012

⏰ 10:00 - 10:45
Практика
 История России
Егорова Анастасия Васильевна
2705
с 10.02. ул. Б.С.-Пб, 41

⏰ 12:00 - 13:45
Лекция
 Высшая математика
Ласунский Александр Васильевич
5поточная
ул. Б.С.-Пб, 41

⏰ 14:00 - 15:45
Лекция
 Экономика
Киварина Мария Валентиновна
4поточная
с 17.02. по верхней неделе, ул. Б.С.-Пб, 41

⏰ 14:00 - 15:45
Лекция
 Инженерная и компьютерная графика
Хаванова Марина Александровна
4поточная
по нижней неделе, ул. Б.С.-Пб, 41

⏰ 16:00 - 17:45
Практика
 Экономика
Киварина Мария Валентиновна
1311
с 17.02. по верхней неделе

⏰ 19:00 - 20:45
Практика
 Экономика
Киварина Мария Валентиновна
с использованием ДОТ
"""

schedule_tuesday4012 = """
Вторник
Группа 4012

⏰ 14:00 - 15:45
Практика
 Практика учебная: Научно-исследовательская работа (получение первичных навыков научно-исследовательской работы)
Зубов Виталий Олегович
2.13.1
ИНТЦ-Валдай, Великая, 18а
"""

schedule_wednesday4012 = """
Среда
Группа 4012

⏰ 11:00 - 11:45
Лекция
 История России
Федорук Наталья Сергеевна
3поточная

⏰ 12:00 - 14:45
Практика
 Высшая математика
Ласунский Александр Васильевич
2708

⏰ 16:00 - 17:45
Лабораторная
 Физика
Ариас Елена Анатольевна
2909

⏰ 18:00 - 19:45
Практика
 Пакеты математического моделирования
Сидоров О. О.
2712
"""

schedule_thursday4012 = """
Четверг
Группа 4012

 Проектный день
только 27.02,27.03, 29.05

⏰ 9:00 - 10:45
Практика
 Инженерная и компьютерная графика
Шергин С. С.
2609
только 27.02,27.03, 29.05 занятий не будет

⏰ 11:00 - 12:45
Лекция
 Физика
Гаврушко Валерий Владимирович
1поточная
только 27.02,27.03, 29.05 занятий не будет

⏰ 14:00 - 14:45
 Основы проектной деятельности
https://portal.novsu.ru/study/newUniversity/i.1531736/?id=1651915
"""

schedule_friday4012 = """
Пятница
Группа 4012

 Проектный день
только 28.02,28.03, 02.05, 30.05

⏰ 9:00 - 9:45
Практика
 Физика
Рохлова Ксения Витальевна
5поточная
ул. Б.С.-Пб, 41, только 28.02,28.03, 02.05, 30.05 занятий не будет

⏰ 10:00 - 11:45
Практика
  Физическая культура и спорт (элективный курс)
Егорова Елена Алексеевна
Спортзал
ул. Б.С.-Пб, 41, только 28.02,28.03, 02.05, 30.05 занятий не будет

⏰ 13:00 - 14:45
Практика
 Иностранный язык
Лопачев Артём Олегович
1331
англ. яз. по нижней неделе Антоново, ИГУМ, только 28.02, 28.03 занятий не будет

⏰ 13:00 - 14:45
Практика
 Иностранный язык
Лопачев Артём Олегович
англ. яз. по верхней неделе с использованием ДОТ

⏰ 16:00 - 16:45
Лекция
 История России
Федорук Наталья Сергеевна
с использованием ДОТ

⏰ 17:00 - 17:45
Практика
 История России
Егорова Анастасия Васильевна
с использованием ДОТ
"""

schedule_saturday4012 = """
Суббота
Группа 4012

 День самостоятельной работы студента
"""